first_routes_controllers/app/controllers/artworks_controller.rb

    def index
        artist = User.find(params[:artist_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]

    def create
        # render json: params
        artwork = Artwork.new(artworks_params)
        # replace the `user_attributes_here` with the actual attribute keys
        if artwork.save
---
INSERT INTO "artworks" ("title", "image_url", "artist_id") VALUES ($1, $2, $3) RETURNING "id"  [["title", "rock"], ["image_url", "rock.com"], ["artist_id", 2]]

    def update
        # update looks similar to create, but instead of instantiating a new tweet to save to the database, we'll lookup the tweet we want to update in the database using the wildcard from the Url, which we find in the params object
            artwork = Artwork.find(params[:id])

            if artwork.update(artworks_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1 WHERE "artworks"."id" = $2  [["title", "rocks"], ["id", 5]]