first_routes_controllers/app/controllers/users_controller.rb

    def create
        # render json: params
        user = User.new(user_params)
        # replace the `user_attributes_here` with the actual attribute keys
        if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "David"], ["email", "david@gmail.com"], ["created_at", "2021-02-03 22:04:46.938514"], ["updated_at", "2021-02-03 22:04:46.938514"]]

    def update
        # update looks similar to create, but instead of instantiating a new tweet to save to the database, we'll lookup the tweet we want to update in the database using the wildcard from the Url, which we find in the params object
            user = User.find(params[:id])

            if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Carol"], ["email", "carol@gmail.com"], ["updated_at", "2021-02-04 18:51:01.641588"], ["id", 1]]